zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp253axx_cm0.h
/****************  Bit definition for HSEM_G1CIDCFGR register  ****************/
#define HSEM_G1CIDCFGR_CFEN_Pos         (0U)
#define HSEM_G1CIDCFGR_CFEN_Msk         (0x1UL << HSEM_G1CIDCFGR_CFEN_Pos)         /*!< 0x00000001 */
#define HSEM_G1CIDCFGR_CFEN             HSEM_G1CIDCFGR_CFEN_Msk                   /*!< Semaphore group p global CID filtering enable. */
#define HSEM_G1CIDCFGR_SEM_WLIST_C_Pos  (16U)
#define HSEM_G1CIDCFGR_SEM_WLIST_C_Msk  (0x7UL << HSEM_G1CIDCFGR_SEM_WLIST_C_Pos)  /*!< 0x00070000 */
#define HSEM_G1CIDCFGR_SEM_WLIST_C      HSEM_G1CIDCFGR_SEM_WLIST_C_Msk            /*!< Semaphore group p CID filtering enable. */

/****************  Bit definition for HSEM_G2CIDCFGR register  ****************/
#define HSEM_G2CIDCFGR_CFEN_Pos         (0U)
#define HSEM_G2CIDCFGR_CFEN_Msk         (0x1UL << HSEM_G2CIDCFGR_CFEN_Pos)         /*!< 0x00000001 */
#define HSEM_G2CIDCFGR_CFEN             HSEM_G2CIDCFGR_CFEN_Msk                   /*!< Semaphore group p global CID filtering enable. */
#define HSEM_G2CIDCFGR_SEM_WLIST_C_Pos  (16U)
#define HSEM_G2CIDCFGR_SEM_WLIST_C_Msk  (0x7UL << HSEM_G2CIDCFGR_SEM_WLIST_C_Pos)  /*!< 0x00070000 */
#define HSEM_G2CIDCFGR_SEM_WLIST_C      HSEM_G2CIDCFGR_SEM_WLIST_C_Msk            /*!< Semaphore group p CID filtering enable. */

/****************  Bit definition for HSEM_G3CIDCFGR register  ****************/
#define HSEM_G3CIDCFGR_CFEN_Pos         (0U)
#define HSEM_G3CIDCFGR_CFEN_Msk         (0x1UL << HSEM_G3CIDCFGR_CFEN_Pos)         /*!< 0x00000001 */
#define HSEM_G3CIDCFGR_CFEN             HSEM_G3CIDCFGR_CFEN_Msk                   /*!< Semaphore group p global CID filtering enable. */
#define HSEM_G3CIDCFGR_SEM_WLIST_C_Pos  (16U)
#define HSEM_G3CIDCFGR_SEM_WLIST_C_Msk  (0x7UL << HSEM_G3CIDCFGR_SEM_WLIST_C_Pos)  /*!< 0x00070000 */
#define HSEM_G3CIDCFGR_SEM_WLIST_C      HSEM_G3CIDCFGR_SEM_WLIST_C_Msk            /*!< Semaphore group p CID filtering enable. */

/*****************  Bit definition for HSEM_HWCFGR2 register  *****************/
#define HSEM_HWCFGR2_MASTERID1_Pos      (0U)
#define HSEM_HWCFGR2_MASTERID1_Msk      (0xFUL << HSEM_HWCFGR2_MASTERID1_Pos)      /*!< 0x0000000F */
#define HSEM_HWCFGR2_MASTERID1          HSEM_HWCFGR2_MASTERID1_Msk                /*!< Hardware configuration valid bus masters ID1 */
#define HSEM_HWCFGR2_MASTERID2_Pos      (4U)
#define HSEM_HWCFGR2_MASTERID2_Msk      (0xFUL << HSEM_HWCFGR2_MASTERID2_Pos)      /*!< 0x000000F0 */
#define HSEM_HWCFGR2_MASTERID2          HSEM_HWCFGR2_MASTERID2_Msk                /*!< Hardware configuration valid bus masters ID2 */
#define HSEM_HWCFGR2_MASTERID3_Pos      (8U)
#define HSEM_HWCFGR2_MASTERID3_Msk      (0xFUL << HSEM_HWCFGR2_MASTERID3_Pos)      /*!< 0x00000F00 */
#define HSEM_HWCFGR2_MASTERID3          HSEM_HWCFGR2_MASTERID3_Msk                /*!< Hardware configuration valid bus masters ID3 */
#define HSEM_HWCFGR2_MASTERID4_Pos      (12U)
#define HSEM_HWCFGR2_MASTERID4_Msk      (0xFUL << HSEM_HWCFGR2_MASTERID4_Pos)      /*!< 0x0000F000 */
#define HSEM_HWCFGR2_MASTERID4          HSEM_HWCFGR2_MASTERID4_Msk                /*!< Hardware configuration valid bus masters ID4 */

/*****************  Bit definition for HSEM_HWCFGR1 register  *****************/
#define HSEM_HWCFGR1_NBSEM_Pos          (0U)
#define HSEM_HWCFGR1_NBSEM_Msk          (0xFFUL << HSEM_HWCFGR1_NBSEM_Pos)         /*!< 0x000000FF */
#define HSEM_HWCFGR1_NBSEM              HSEM_HWCFGR1_NBSEM_Msk                    /*!< Hardware configuration number of semaphores */
#define HSEM_HWCFGR1_NBINT_Pos          (8U)
#define HSEM_HWCFGR1_NBINT_Msk          (0xFUL << HSEM_HWCFGR1_NBINT_Pos)          /*!< 0x00000F00 */
#define HSEM_HWCFGR1_NBINT              HSEM_HWCFGR1_NBINT_Msk                    /*!< Hardware configuration number of interrupts/supported number of master ID */
#define HSEM_HWCFGR1_CID_WIDTH_Pos      (12U)
#define HSEM_HWCFGR1_CID_WIDTH_Msk      (0xFUL << HSEM_HWCFGR1_CID_WIDTH_Pos)      /*!< 0x0000F000 */
#define HSEM_HWCFGR1_CID_WIDTH          HSEM_HWCFGR1_CID_WIDTH_Msk                /*!< Hardware Configuration compartment isolation bus width */
#define HSEM_HWCFGR1_SECEN_Pos          (16U)
#define HSEM_HWCFGR1_SECEN_Msk          (0x1UL << HSEM_HWCFGR1_SECEN_Pos)          /*!< 0x00010000 */
#define HSEM_HWCFGR1_SECEN              HSEM_HWCFGR1_SECEN_Msk                    /*!< Hardware Configuration security protection enable */
#define HSEM_HWCFGR1_PRIVEN_Pos         (17U)
#define HSEM_HWCFGR1_PRIVEN_Msk         (0x1UL << HSEM_HWCFGR1_PRIVEN_Pos)         /*!< 0x00020000 */
#define HSEM_HWCFGR1_PRIVEN             HSEM_HWCFGR1_PRIVEN_Msk                   /*!< Hardware Configuration privilege protection enable */
#define HSEM_HWCFGR1_CFEN_Pos           (18U)
#define HSEM_HWCFGR1_CFEN_Msk           (0x1UL << HSEM_HWCFGR1_CFEN_Pos)           /*!< 0x00040000 */
#define HSEM_HWCFGR1_CFEN               HSEM_HWCFGR1_CFEN_Msk                     /*!< Hardware Configuration compartment filtering enable */

/******************  Bit definition for HSEM_VERR register  *******************/
#define HSEM_VERR_MINREV_Pos            (0U)
#define HSEM_VERR_MINREV_Msk            (0xFUL << HSEM_VERR_MINREV_Pos)            /*!< 0x0000000F */
#define HSEM_VERR_MINREV                HSEM_VERR_MINREV_Msk                      /*!< IP minor revision number */
#define HSEM_VERR_MAJREV_Pos            (4U)
#define HSEM_VERR_MAJREV_Msk            (0xFUL << HSEM_VERR_MAJREV_Pos)            /*!< 0x000000F0 */
#define HSEM_VERR_MAJREV                HSEM_VERR_MAJREV_Msk                      /*!< IP major revision number */

/******************  Bit definition for HSEM_IPIDR register  ******************/
#define HSEM_IPIDR_IPID_Pos             (0U)
#define HSEM_IPIDR_IPID_Msk             (0xFFFFFFFFUL << HSEM_IPIDR_IPID_Pos)      /*!< 0xFFFFFFFF */
#define HSEM_IPIDR_IPID                 HSEM_IPIDR_IPID_Msk                       /*!< IP identification */

/******************  Bit definition for HSEM_SIDR register  *******************/
#define HSEM_SIDR_SID_Pos               (0U)
#define HSEM_SIDR_SID_Msk               (0xFFFFFFFFUL << HSEM_SIDR_SID_Pos)        /*!< 0xFFFFFFFF */
#define HSEM_SIDR_SID                   HSEM_SIDR_SID_Msk                         /*!< IP size identification */

/******************************************************************************/
/*                                                                            */
/*                      Inter-integrated Circuit Interface (I2C)              */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for I2C_CR1 register  *******************/
#define I2C_CR1_PE_Pos               (0U)
#define I2C_CR1_PE_Msk               (0x1UL << I2C_CR1_PE_Pos)                  /*!< 0x00000001 */
#define I2C_CR1_PE                   I2C_CR1_PE_Msk                            /*!< Peripheral enable */
#define I2C_CR1_TXIE_Pos             (1U)
#define I2C_CR1_TXIE_Msk             (0x1UL << I2C_CR1_TXIE_Pos)                /*!< 0x00000002 */
#define I2C_CR1_TXIE                 I2C_CR1_TXIE_Msk                          /*!< TX interrupt enable */
#define I2C_CR1_RXIE_Pos             (2U)
#define I2C_CR1_RXIE_Msk             (0x1UL << I2C_CR1_RXIE_Pos)                /*!< 0x00000004 */
#define I2C_CR1_RXIE                 I2C_CR1_RXIE_Msk                          /*!< RX interrupt enable */
#define I2C_CR1_ADDRIE_Pos           (3U)
#define I2C_CR1_ADDRIE_Msk           (0x1UL << I2C_CR1_ADDRIE_Pos)              /*!< 0x00000008 */
#define I2C_CR1_ADDRIE               I2C_CR1_ADDRIE_Msk                        /*!< Address match interrupt enable */
#define I2C_CR1_NACKIE_Pos           (4U)
#define I2C_CR1_NACKIE_Msk           (0x1UL << I2C_CR1_NACKIE_Pos)              /*!< 0x00000010 */
#define I2C_CR1_NACKIE               I2C_CR1_NACKIE_Msk                        /*!< NACK received interrupt enable */
#define I2C_CR1_STOPIE_Pos           (5U)
#define I2C_CR1_STOPIE_Msk           (0x1UL << I2C_CR1_STOPIE_Pos)              /*!< 0x00000020 */
#define I2C_CR1_STOPIE               I2C_CR1_STOPIE_Msk                        /*!< STOP detection interrupt enable */
#define I2C_CR1_TCIE_Pos             (6U)
#define I2C_CR1_TCIE_Msk             (0x1UL << I2C_CR1_TCIE_Pos)                /*!< 0x00000040 */
#define I2C_CR1_TCIE                 I2C_CR1_TCIE_Msk                          /*!< Transfer complete interrupt enable */
#define I2C_CR1_ERRIE_Pos            (7U)
#define I2C_CR1_ERRIE_Msk            (0x1UL << I2C_CR1_ERRIE_Pos)               /*!< 0x00000080 */
#define I2C_CR1_ERRIE                I2C_CR1_ERRIE_Msk                         /*!< Errors interrupt enable */
#define I2C_CR1_DNF_Pos              (8U)
#define I2C_CR1_DNF_Msk              (0xFUL << I2C_CR1_DNF_Pos)                 /*!< 0x00000F00 */
#define I2C_CR1_DNF                  I2C_CR1_DNF_Msk                           /*!< Digital noise filter */
#define I2C_CR1_ANFOFF_Pos           (12U)
#define I2C_CR1_ANFOFF_Msk           (0x1UL << I2C_CR1_ANFOFF_Pos)              /*!< 0x00001000 */
#define I2C_CR1_ANFOFF               I2C_CR1_ANFOFF_Msk                        /*!< Analog noise filter OFF */
#define I2C_CR1_SWRST_Pos            (13U)
#define I2C_CR1_SWRST_Msk            (0x1UL << I2C_CR1_SWRST_Pos)               /*!< 0x00002000 */
#define I2C_CR1_SWRST                I2C_CR1_SWRST_Msk                         /*!< Software reset */
#define I2C_CR1_TXDMAEN_Pos          (14U)
#define I2C_CR1_TXDMAEN_Msk          (0x1UL << I2C_CR1_TXDMAEN_Pos)             /*!< 0x00004000 */
#define I2C_CR1_TXDMAEN              I2C_CR1_TXDMAEN_Msk                       /*!< DMA transmission requests enable */
#define I2C_CR1_RXDMAEN_Pos          (15U)
#define I2C_CR1_RXDMAEN_Msk          (0x1UL << I2C_CR1_RXDMAEN_Pos)             /*!< 0x00008000 */
#define I2C_CR1_RXDMAEN              I2C_CR1_RXDMAEN_Msk                       /*!< DMA reception requests enable */
#define I2C_CR1_SBC_Pos              (16U)
#define I2C_CR1_SBC_Msk              (0x1UL << I2C_CR1_SBC_Pos)                 /*!< 0x00010000 */
#define I2C_CR1_SBC                  I2C_CR1_SBC_Msk                           /*!< Slave byte control */
#define I2C_CR1_NOSTRETCH_Pos        (17U)
#define I2C_CR1_NOSTRETCH_Msk        (0x1UL << I2C_CR1_NOSTRETCH_Pos)           /*!< 0x00020000 */
#define I2C_CR1_NOSTRETCH            I2C_CR1_NOSTRETCH_Msk                     /*!< Clock stretching disable */
#define I2C_CR1_WUPEN_Pos            (18U)
#define I2C_CR1_WUPEN_Msk            (0x1UL << I2C_CR1_WUPEN_Pos)               /*!< 0x00040000 */
#define I2C_CR1_WUPEN                I2C_CR1_WUPEN_Msk                         /*!< Wakeup from STOP enable */
#define I2C_CR1_GCEN_Pos             (19U)
#define I2C_CR1_GCEN_Msk             (0x1UL << I2C_CR1_GCEN_Pos)                /*!< 0x00080000 */
#define I2C_CR1_GCEN                 I2C_CR1_GCEN_Msk                          /*!< General call enable */
#define I2C_CR1_SMBHEN_Pos           (20U)
#define I2C_CR1_SMBHEN_Msk           (0x1UL << I2C_CR1_SMBHEN_Pos)              /*!< 0x00100000 */
#define I2C_CR1_SMBHEN               I2C_CR1_SMBHEN_Msk                        /*!< SMBus host address enable */
#define I2C_CR1_SMBDEN_Pos           (21U)
#define I2C_CR1_SMBDEN_Msk           (0x1UL << I2C_CR1_SMBDEN_Pos)              /*!< 0x00200000 */
#define I2C_CR1_SMBDEN               I2C_CR1_SMBDEN_Msk                        /*!< SMBus device default address enable */
#define I2C_CR1_ALERTEN_Pos          (22U)
#define I2C_CR1_ALERTEN_Msk          (0x1UL << I2C_CR1_ALERTEN_Pos)             /*!< 0x00400000 */
#define I2C_CR1_ALERTEN              I2C_CR1_ALERTEN_Msk                       /*!< SMBus alert enable */
#define I2C_CR1_PECEN_Pos            (23U)
#define I2C_CR1_PECEN_Msk            (0x1UL << I2C_CR1_PECEN_Pos)               /*!< 0x00800000 */
#define I2C_CR1_PECEN                I2C_CR1_PECEN_Msk                         /*!< PEC enable */
#define I2C_CR1_FMP_Pos              (24U)
#define I2C_CR1_FMP_Msk              (0x1UL << I2C_CR1_FMP_Pos)                 /*!< 0x01000000 */
#define I2C_CR1_FMP                  I2C_CR1_FMP_Msk                           /*!< Fast-mode Plus 20mA drive enable */
#define I2C_CR1_ADDRACLR_Pos         (30U)
#define I2C_CR1_ADDRACLR_Msk         (0x1UL << I2C_CR1_ADDRACLR_Pos)            /*!< 0x40000000 */
#define I2C_CR1_ADDRACLR             I2C_CR1_ADDRACLR_Msk                      /*!< Address match flag (ADDR) automatic clear */
#define I2C_CR1_STOPFACLR_Pos        (31U)
#define I2C_CR1_STOPFACLR_Msk        (0x1UL << I2C_CR1_STOPFACLR_Pos)           /*!< 0x80000000 */
#define I2C_CR1_STOPFACLR            I2C_CR1_STOPFACLR_Msk                     /*!< STOP detection flag (STOPF) automatic clear */

/******************  Bit definition for I2C_CR2 register  ********************/
#define I2C_CR2_SADD_Pos             (0U)
#define I2C_CR2_SADD_Msk             (0x3FFUL << I2C_CR2_SADD_Pos)              /*!< 0x000003FF */
#define I2C_CR2_SADD                 I2C_CR2_SADD_Msk                          /*!< Slave address (master mode) */
#define I2C_CR2_RD_WRN_Pos           (10U)
#define I2C_CR2_RD_WRN_Msk           (0x1UL << I2C_CR2_RD_WRN_Pos)              /*!< 0x00000400 */
#define I2C_CR2_RD_WRN               I2C_CR2_RD_WRN_Msk                        /*!< Transfer direction (master mode) */
#define I2C_CR2_ADD10_Pos            (11U)
#define I2C_CR2_ADD10_Msk            (0x1UL << I2C_CR2_ADD10_Pos)               /*!< 0x00000800 */
#define I2C_CR2_ADD10                I2C_CR2_ADD10_Msk                         /*!< 10-bit addressing mode (master mode) */
#define I2C_CR2_HEAD10R_Pos          (12U)
#define I2C_CR2_HEAD10R_Msk          (0x1UL << I2C_CR2_HEAD10R_Pos)             /*!< 0x00001000 */
#define I2C_CR2_HEAD10R              I2C_CR2_HEAD10R_Msk                       /*!< 10-bit address header only read direction (master mode) */
#define I2C_CR2_START_Pos            (13U)
#define I2C_CR2_START_Msk            (0x1UL << I2C_CR2_START_Pos)               /*!< 0x00002000 */
#define I2C_CR2_START                I2C_CR2_START_Msk                         /*!< START generation */
#define I2C_CR2_STOP_Pos             (14U)
#define I2C_CR2_STOP_Msk             (0x1UL << I2C_CR2_STOP_Pos)                /*!< 0x00004000 */
#define I2C_CR2_STOP                 I2C_CR2_STOP_Msk                          /*!< STOP generation (master mode) */
#define I2C_CR2_NACK_Pos             (15U)
#define I2C_CR2_NACK_Msk             (0x1UL << I2C_CR2_NACK_Pos)                /*!< 0x00008000 */
#define I2C_CR2_NACK                 I2C_CR2_NACK_Msk                          /*!< NACK generation (slave mode) */
#define I2C_CR2_NBYTES_Pos           (16U)
#define I2C_CR2_NBYTES_Msk           (0xFFUL << I2C_CR2_NBYTES_Pos)             /*!< 0x00FF0000 */
#define I2C_CR2_NBYTES               I2C_CR2_NBYTES_Msk                        /*!< Number of bytes */
#define I2C_CR2_RELOAD_Pos           (24U)
#define I2C_CR2_RELOAD_Msk           (0x1UL << I2C_CR2_RELOAD_Pos)              /*!< 0x01000000 */
#define I2C_CR2_RELOAD               I2C_CR2_RELOAD_Msk                        /*!< NBYTES reload mode */
#define I2C_CR2_AUTOEND_Pos          (25U)
#define I2C_CR2_AUTOEND_Msk          (0x1UL << I2C_CR2_AUTOEND_Pos)             /*!< 0x02000000 */
#define I2C_CR2_AUTOEND              I2C_CR2_AUTOEND_Msk                       /*!< Automatic end mode (master mode) */
#define I2C_CR2_PECBYTE_Pos          (26U)
#define I2C_CR2_PECBYTE_Msk          (0x1UL << I2C_CR2_PECBYTE_Pos)             /*!< 0x04000000 */
#define I2C_CR2_PECBYTE              I2C_CR2_PECBYTE_Msk                       /*!< Packet error checking byte */

/*******************  Bit definition for I2C_OAR1 register  ******************/
#define I2C_OAR1_OA1_Pos             (0U)
#define I2C_OAR1_OA1_Msk             (0x3FFUL << I2C_OAR1_OA1_Pos)              /*!< 0x000003FF */
#define I2C_OAR1_OA1                 I2C_OAR1_OA1_Msk                          /*!< Interface own address 1 */
#define I2C_OAR1_OA1MODE_Pos         (10U)
#define I2C_OAR1_OA1MODE_Msk         (0x1UL << I2C_OAR1_OA1MODE_Pos)            /*!< 0x00000400 */
#define I2C_OAR1_OA1MODE             I2C_OAR1_OA1MODE_Msk                      /*!< Own address 1 10-bit mode */
#define I2C_OAR1_OA1EN_Pos           (15U)
#define I2C_OAR1_OA1EN_Msk           (0x1UL << I2C_OAR1_OA1EN_Pos)              /*!< 0x00008000 */
#define I2C_OAR1_OA1EN               I2C_OAR1_OA1EN_Msk                        /*!< Own address 1 enable */

